{
  "format": "graph-model",
  "userDefinedMetadata": {
    "signature": {
      "outputs": { "SemanticPredictions": { "name": "SemanticPredictions" } }
    }
  },
  "modelTopology": {
    "node": [
      {
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } }
        },
        "name": "sub_1/x",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "2" }] }
            }
          }
        },
        "name": "stack_2",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [{ "size": "1" }, { "size": "1" }, { "size": "3" }]
              }
            }
          }
        },
        "name": "Reshape",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } }
        },
        "name": "stack/0",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": {} } }
        },
        "name": "mul_1/x",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": { "tensor": { "dtype": "DT_FLOAT", "tensorShape": {} } }
        },
        "name": "ToFloat/x",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "384" },
                  { "size": "1" }
                ]
              }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_7/depthwise/depthwise_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "384" },
                  { "size": "1" }
                ]
              }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_8/depthwise/depthwise_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "384" },
                  { "size": "1" }
                ]
              }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_9/depthwise/depthwise_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "384" },
                  { "size": "1" }
                ]
              }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_10/depthwise/depthwise_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "576" },
                  { "size": "1" }
                ]
              }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_11/depthwise/depthwise_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "576" },
                  { "size": "1" }
                ]
              }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_12/depthwise/depthwise_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "2" }, { "size": "2" }] }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_7/depthwise/depthwise/SpaceToBatchND/paddings",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "576" },
                  { "size": "1" }
                ]
              }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_13/depthwise/depthwise_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "2" }] }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_7/depthwise/depthwise/SpaceToBatchND/block_shape",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "2" }, { "size": "2" }] }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_7/depthwise/depthwise/BatchToSpaceND/crops",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "960" },
                  { "size": "1" }
                ]
              }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_14/depthwise/depthwise_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "960" },
                  { "size": "1" }
                ]
              }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_15/depthwise/depthwise_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "2" }, { "size": "2" }] }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_14/depthwise/depthwise/SpaceToBatchND/paddings",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "960" },
                  { "size": "1" }
                ]
              }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_16/depthwise/depthwise_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "2" }] }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_14/depthwise/depthwise/SpaceToBatchND/block_shape",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "2" }, { "size": "2" }] }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_14/depthwise/depthwise/BatchToSpaceND/crops",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "256" },
                  { "size": "21" }
                ]
              }
            }
          }
        },
        "name": "logits/semantic/weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "21" }] }
            }
          }
        },
        "name": "logits/semantic/biases",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "2" }] }
            }
          }
        },
        "name": "ResizeBilinear_1/size",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "2" }] }
            }
          }
        },
        "name": "strided_slice_7",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } }
        },
        "name": "Rank",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "3" }] }
            }
          }
        },
        "name": "SemanticPredictions/begin",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } }
        },
        "name": "SemanticPredictions/size/0",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          }
        },
        "name": "strided_slice_3/stack",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_UINT8" },
          "shape": {
            "shape": {
              "dim": [
                { "size": "1" },
                { "size": "-1" },
                { "size": "-1" },
                { "size": "3" }
              ]
            }
          }
        },
        "name": "ImageTensor",
        "op": "Placeholder"
      },
      {
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          }
        },
        "name": "strided_slice_7/stack_1",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          }
        },
        "name": "strided_slice_4/stack_1",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_INT32" },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          }
        },
        "name": "strided_slice_4/stack",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "32" }
                ]
              }
            }
          }
        },
        "name": "MobilenetV2/Conv/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "32" }] }
            }
          }
        },
        "name": "MobilenetV2/Conv/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "960" }] }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_15/depthwise/BatchNorm/FusedBatchNorm/Offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "32" },
                  { "size": "1" }
                ]
              }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv/depthwise/depthwise_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "32" }] }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv/depthwise/depthwise_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "32" },
                  { "size": "16" }
                ]
              }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv/project/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "16" }] }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv/project/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "16" },
                  { "size": "96" }
                ]
              }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_1/expand/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "96" }] }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_1/expand/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "96" },
                  { "size": "1" }
                ]
              }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_1/depthwise/depthwise_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "96" }] }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_1/depthwise/depthwise_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "96" },
                  { "size": "24" }
                ]
              }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_1/project/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "960" }] }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_14/depthwise/BatchNorm/FusedBatchNorm/Scaled",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "24" }] }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_1/project/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "24" },
                  { "size": "144" }
                ]
              }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_2/expand/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "144" }] }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_2/expand/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "144" },
                  { "size": "1" }
                ]
              }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_2/depthwise/depthwise_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "144" }] }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_2/depthwise/depthwise_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "144" },
                  { "size": "24" }
                ]
              }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_2/project/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "960" }] }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_14/depthwise/BatchNorm/FusedBatchNorm/Offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "24" }] }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_2/project/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "24" },
                  { "size": "144" }
                ]
              }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_3/expand/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "144" }] }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_3/expand/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "144" },
                  { "size": "1" }
                ]
              }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_3/depthwise/depthwise_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "144" }] }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_3/depthwise/depthwise_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "144" },
                  { "size": "32" }
                ]
              }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_3/project/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "32" }] }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_3/project/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "32" },
                  { "size": "192" }
                ]
              }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_4/expand/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "576" }] }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_13/depthwise/BatchNorm/FusedBatchNorm/Scaled",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "192" }] }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_4/expand/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "192" },
                  { "size": "1" }
                ]
              }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_4/depthwise/depthwise_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "192" }] }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_4/depthwise/depthwise_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "192" },
                  { "size": "32" }
                ]
              }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_4/project/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "32" }] }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_4/project/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "32" },
                  { "size": "192" }
                ]
              }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_5/expand/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "576" }] }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_13/depthwise/BatchNorm/FusedBatchNorm/Offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "192" }] }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_5/expand/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "192" },
                  { "size": "1" }
                ]
              }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_5/depthwise/depthwise_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "192" }] }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_5/depthwise/depthwise_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "192" },
                  { "size": "32" }
                ]
              }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_5/project/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "32" }] }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_5/project/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "32" },
                  { "size": "192" }
                ]
              }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_6/expand/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "192" }] }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_6/expand/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "576" }] }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_12/depthwise/BatchNorm/FusedBatchNorm/Scaled",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "192" },
                  { "size": "1" }
                ]
              }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_6/depthwise/depthwise_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "192" }] }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_6/depthwise/depthwise_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "192" },
                  { "size": "64" }
                ]
              }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_6/project/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_6/project/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "64" },
                  { "size": "384" }
                ]
              }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_7/expand/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "384" }] }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_7/expand/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "576" }] }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_12/depthwise/BatchNorm/FusedBatchNorm/Offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "384" },
                  { "size": "64" }
                ]
              }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_7/project/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_7/project/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "64" },
                  { "size": "384" }
                ]
              }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_8/expand/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "384" }] }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_8/expand/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "384" },
                  { "size": "64" }
                ]
              }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_8/project/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "576" }] }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_11/depthwise/BatchNorm/FusedBatchNorm/Scaled",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_8/project/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "64" },
                  { "size": "384" }
                ]
              }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_9/expand/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "384" }] }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_9/expand/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "384" },
                  { "size": "64" }
                ]
              }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_9/project/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "576" }] }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_11/depthwise/BatchNorm/FusedBatchNorm/Offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_9/project/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "64" },
                  { "size": "384" }
                ]
              }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_10/expand/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "384" }] }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_10/expand/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "384" },
                  { "size": "96" }
                ]
              }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_10/project/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "96" }] }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_10/project/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "96" },
                  { "size": "576" }
                ]
              }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_11/expand/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "384" }] }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_10/depthwise/BatchNorm/FusedBatchNorm/Scaled",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "576" }] }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_11/expand/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "576" },
                  { "size": "96" }
                ]
              }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_11/project/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "96" }] }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_11/project/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "96" },
                  { "size": "576" }
                ]
              }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_12/expand/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "384" }] }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_10/depthwise/BatchNorm/FusedBatchNorm/Offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "576" }] }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_12/expand/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "576" },
                  { "size": "96" }
                ]
              }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_12/project/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "96" }] }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_12/project/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "96" },
                  { "size": "576" }
                ]
              }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_13/expand/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "576" }] }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_13/expand/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "384" }] }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_9/depthwise/BatchNorm/FusedBatchNorm/Scaled",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "576" },
                  { "size": "160" }
                ]
              }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_13/project/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "160" }] }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_13/project/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "160" },
                  { "size": "960" }
                ]
              }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_14/expand/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "960" }] }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_14/expand/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "384" }] }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_9/depthwise/BatchNorm/FusedBatchNorm/Offset",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "1" },
                  { "size": "1" },
                  { "size": "960" },
                  { "size": "160" }
                ]
              }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_14/project/Conv2D_weights",
        "op": "Const"
      },
      {
        "attr": {
          "dtype": { "type": "DT_FLOAT" },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "160" }] }
            }
          }
        },
        "name": "MobilenetV2/expanded_conv_14/project/Conv2D_bn_offset",
        "op": "Const"
      },
      {
        "attr": {
